sysbench/test_partition_global.log
do sysbench oltp_point_select, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 135740.65 qps: 135740.65 (r/w/o: 135740.65/0.00/0.00) lat (ms,95%): 0.62 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 143150.79 qps: 143150.79 (r/w/o: 143150.79/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 143229.59 qps: 143229.59 (r/w/o: 143229.59/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 143667.58 qps: 143667.58 (r/w/o: 143667.58/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 143262.46 qps: 143262.56 (r/w/o: 143262.56/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 144364.65 qps: 144364.55 (r/w/o: 144364.55/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 144693.66 qps: 144693.66 (r/w/o: 144693.66/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 143977.71 qps: 143977.71 (r/w/o: 143977.71/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 143350.48 qps: 143350.48 (r/w/o: 143350.48/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 145427.69 qps: 145427.69 (r/w/o: 145427.69/0.00/0.00) lat (ms,95%): 0.57 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 145159.24 qps: 145159.24 (r/w/o: 145159.24/0.00/0.00) lat (ms,95%): 0.57 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 145346.11 qps: 145346.11 (r/w/o: 145346.11/0.00/0.00) lat (ms,95%): 0.57 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            17213997
        write:                           0
        other:                           0
        total:                           17213997
    transactions:                        17213997 (143440.54 per sec.)
    queries:                             17213997 (143440.54 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0066s
    total number of events:              17213997

Latency (ms):
         min:                                    0.23
         avg:                                    0.45
         max:                                   19.01
         95th percentile:                        0.58
         sum:                              7670589.11

Threads fairness:
    events (avg/stddev):           268968.7031/1928.27
    execution time (avg/stddev):   119.8530/0.00

do sysbench oltp_point_select, thread=128
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 242594.76 qps: 242594.76 (r/w/o: 242594.76/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 243972.19 qps: 243972.19 (r/w/o: 243972.19/0.00/0.00) lat (ms,95%): 0.78 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 241357.58 qps: 241357.58 (r/w/o: 241357.58/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 238299.21 qps: 238299.21 (r/w/o: 238299.21/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 241896.88 qps: 241896.88 (r/w/o: 241896.88/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 240861.34 qps: 240861.34 (r/w/o: 240861.34/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 242407.45 qps: 242407.45 (r/w/o: 242407.45/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 240855.17 qps: 240855.17 (r/w/o: 240855.17/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 237724.27 qps: 237724.27 (r/w/o: 237724.27/0.00/0.00) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 238154.56 qps: 238154.56 (r/w/o: 238154.56/0.00/0.00) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 242069.30 qps: 242069.30 (r/w/o: 242069.30/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 240249.08 qps: 240249.08 (r/w/o: 240249.08/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            28904962
        write:                           0
        other:                           0
        total:                           28904962
    transactions:                        28904962 (240842.22 per sec.)
    queries:                             28904962 (240842.22 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0148s
    total number of events:              28904962

Latency (ms):
         min:                                    0.22
         avg:                                    0.53
         max:                                   11.20
         95th percentile:                        0.80
         sum:                             15343508.80

Threads fairness:
    events (avg/stddev):           225820.0156/2963.37
    execution time (avg/stddev):   119.8712/0.00

do sysbench select_random_ranges, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 48288.49 qps: 48288.49 (r/w/o: 48288.49/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 48541.38 qps: 48541.38 (r/w/o: 48541.38/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 47940.50 qps: 47940.50 (r/w/o: 47940.50/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 48046.16 qps: 48046.16 (r/w/o: 48046.16/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 48377.47 qps: 48377.47 (r/w/o: 48377.47/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 47758.73 qps: 47758.73 (r/w/o: 47758.73/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 47979.49 qps: 47979.49 (r/w/o: 47979.49/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00